<?php

return [
	'error_999' => 'خطای هندل نشده!', // unofficial error code --- added by Tartan

	'canceled_by_user' => 'تراکنش بانکی توسط کاربر لغو شد',
	'could_not_request_payment' => 'امکان درخواست توکن برای این تراکنش وجود ندارد',
	'could_not_verify_transaction' => 'امکان تایید این تراکنش وجود ندارد',
	'could_not_inquiry_payment' => 'امکان استعلام این تراکنش وجود ندارد',
	'could_not_settle_payment' => 'امکان درخواست واریز وجه برای این تراکنش وجود ندارد',
	'could_not_reverse_payment' => 'انمان بازگشت این تراکنش وجود ندارد',
	'gate_not_ready' => 'درگاه پرداختی یا وجود ندارد یا آماده سرویس دهی نمی باشد',
	'gate_not_implemented_tartan' => 'دروازه پرداخت :name از Tartan\\Larapay\\Adapter\\AdapterInterface پیروی نمی کند',
	'goto_gate' => 'اتصال به درگاه پرداخت',
	'invalid_response' => 'پاسخ معتبر از سرور درگاه پرداخت دریافت نشد!',
	'reversed_failed' => 'بازگشت تراکنش با موفقیت انجام نشد!',
	'verification_failed' => 'تایید تراکنش با موفقیت انجام نشد!',
    'after_verification_failed' => 'تایید بعد از تراکنش با موفقیت انجام نشد!',
    'invalid_sharing_data' => 'اطلاعات تسهیم معتبر نیست',
    'transaction_not_found' => 'تراکنش پیدا نشد',

	'mellat' => [
		'errors' => [
			'error_11' => 'شماره کارت نامعتبر است',
			'error_12' => 'موجودی کافی نیست',
			'error_13' => 'رمز نادرست است',
			'error_14' => 'تعداد دفعات وارد کردن رمز بیش از حد مجاز است',
			'error_15' => 'کارت نامعتبر است',
			'error_16' => 'دفعات برداشت وجه بیش از حد مجاز است',
			'error_17' => 'کاربر از انجام تراکنش منصرف شده است',
			'error_18' => 'تاریخ انقضای کارت گذشته است',
			'error_19' => 'مبلغ برداشت وجه بیش از حد مجاز است',
			'error_21' => 'پذیرنده نامعتبر است',
			'error_23' => 'خطای امنیتی رخ داده است',
			'error_24' => 'اطلاعات کاربری پذیرنده نامعتبر است',
			'error_25' => 'مبلغ نامعتبر است',
			'error_31' => 'پاسخ نامعتبر است',
			'error_32' => 'فرمت اطلاعات وارد شده صحیح نمی‌باشد',
			'error_33' => 'حساب نامعتبر است',
			'error_34' => 'خطای سیستمی',
			'error_35' => 'تاریخ نامعتبر است',
			'error_41' => 'شماره درخواست تکراری است',
			'error_42' => 'تراکنش Sale یافت نشد',
			'error_43' => 'قبلا درخواست Verfiy داده شده است',
			'error_44' => 'درخواست Verfiy یافت نشد',
			'error_45' => 'تراکنش Settle شده است',
			'error_46' => 'تراکنش Settle نشده است',
			'error_47' => 'تراکنش Settle یافت نشد',
			'error_48' => 'تراکنش Reverse شده است',
			'error_49' => 'تراکنش Refund یافت نشد.',
			'error_51' => 'تراکنش تکراری است',
			'error_54' => 'تراکنش مرجع موجود نیست',
			'error_55' => 'تراکنش نامعتبر است',
			'error_61' => 'خطا در واریز',
			'error_111' => 'صادر کننده کارت نامعتبر است',
			'error_112' => 'خطای سوییچ صادر کننده کارت',
			'error_113' => 'پاسخی از صادر کننده کارت دریافت نشد',
			'error_114' => 'دارنده این کارت مجاز به انجام این تراکنش نیست',
			'error_412' => 'شناسه قبض نادرست است',
			'error_413' => 'شناسه پرداخت نادرست است',
			'error_414' => 'سازمان صادر کننده قبض نامعتبر است',
			'error_415' => 'زمان جلسه کاری به پایان رسیده است',
			'error_416' => 'خطا در ثبت اطلاعات',
			'error_417' => 'شناسه پرداخت کننده نامعتبر است',
			'error_418' => 'اشکال در تعریف اطلاعات مشتری',
			'error_419' => 'تعداد دفعات ورود اطلاعات از حد مجاز گذشته است',
			'error_421' => 'IP نامعتبر است',

			'invalid_response' => 'پاسخ معتبر از سرور درگاه پرداخت دریافت نشد!',
		]
	],
	'parsian' => [
		'errors' => [
			'error_20' => 'پین فروشنده درست نمی باشد',
			'error_22' => 'پین فروشنده درست نمی باشد',
			'error_30' => 'عملیات قبلا با موفقیت انجام شده است',
			'error_34' => 'شماره تراکنش فرونشده درست نمی باشد',

			'could_not_continue_with_non0_rs' => 'امکان تایید این تراکنش از سمت درگاه پرداخت وجود ندارد',
			'invalid_response' => 'پاسخ معتبر از سرور درگاه پرداخت دریافت نشد!',
		]
	],
	'pasargad' => [
		'errors' => [

		]
	],
	'saderat' => [
		'errors' => [
			'error_1' => 'وجود خطا در فرمت اطلاعات ارسالی',
			'error_2' => 'عدم وجود پذیرنده و ترمینال مورد درخواست در سیستم',
			'error_3' => 'رد درخواست به علت دریافت درخواست توسط آدرس آی پی نامعتبر',
			'error_4' => 'پذیرنده مورد نظر امکان استفاده از سیستم را ندارد',
			'error_5' => 'برخورد با مشکل در انجام درخواست مورد نظر',
			'error_6' => 'خطا در پردازش درخواست',
			'error_7' => 'بروز خطا در تشخیص اصالت اطلاعات (امضای دیجیتالی نامعتبر است)',
			'error_8' => 'شماره خرید ارائه شده توسط پذیرنده (CRN) تکراری است',
			'error_9' => 'سیستم در حال حاضر قادر به سرویس دهی نمی باشد (این پیام هنگام بروزرسانی سرور برگردانده می شود)',
			'error_102' => 'تراکنش مورد نظر برگشت خورده است',
			'error_103' => 'تایید انجام نشد',
			'error_106' => 'پیامی از سوییچ پرداخت دریافت نشد',
			'error_107' => 'تراکنش درخواستی موجود نیست',
			'error_111' => 'مشکل در ارتباط با سوییچ',
			'error_112' => 'مقادیر ارسالی در درخواست معتبر نیستند',
			'error_113' => 'خطای سمت سرور (مربوط به واحد فنی PSP)',
			'error_200' => 'تراکنش بانکی توسط کاربر لغو شد',
			'error__1' => 'امضای دیجیتال مشکل دارد و با اطلاعات ارسالی همخوانی ندارد',
			'error__2' => 'دسترسی از IP غیر مجاز است',

			'making_openssl_sign_error' => 'ایجاد امضای دیجیتال با استفاده از openssl موفقیت آمیز نبود',
			'invalid_verify_result' => 'اطلاعات دریافتی از درگاه پرداخت معتبر نمی باشد',
			'invalid_transaction' => 'تراکنش  شما معتبر نیست',
			'public_key_file_not_found' => 'فایل public key در مسیر مورد نظر وجود ندارد',
			'private_key_file_not_found' => 'فایل private key در مسیر مورد نظر وجود ندارد',
		]
	],
	'zarinpal' => [
		'errors' => [
			'error_101' => 'عملیات پرداخت موفق بوده و قبلا PaymentVerification تراکنش انجام شده است',

			'error__1' => 'اطلاعات ارسال شده ناقص است', //-1
			'error__2' => 'IP و یا مرچنت کد پذیرنده صحیح نیست', //-1
			'error__3' => 'با توجه به محدودیت‌های شاپرک امکان پرداخت با رقم درخواست شده میسر نمی باشد',
			'error__4' => 'سطح تایید پذیرنده پایین تز از سطح نقره است',
			'error__11' => 'درخواست مورد نظر یافت نشد',
			'error__12 '=> 'امکان ویرایش درخواست میسر نمی باشد',
			'error__21 '=> 'هیچ نوع عملیات مالی برای این تراکنش یافت نشد',
			'error__22 '=> 'تراکنش ناموفق می باشد',
			'error__33 '=> 'رقم تراکنش با رقم پرداخت شده مطابقت ندارد',
			'error__34 '=> 'سقف تقیسم تراکنش از لحاظ تعداد یا رقم عبور نموده است',
			'error__40 '=> 'اجازه دسترسی به متد مربوطه وجود ندارد',
			'error__41 '=> 'اطلاعات ارسال شده به AdditionalData غیر معتبر می باشد',
			'error__42 '=> 'مدت زمان معتبر طول عمر شناسه پرداخت باید بین ۳۰ دقیقه تا ۴۵ روز باشد',
			'error__54 '=> 'درخواست مورد نظر آرشیو شده است',
		]
	]
];
